Tekla.Structures.Model.GridPlane.#ctor
Creates a new grid plane instance.
The default values are as follows:
Plane = new Plane();
Plane.Origin = new Point(500.0, 500.0, 0.0);
Plane.AxisX  = new Vector(2000.0, 0.0, 0.0);
Plane.AxisY  = new Vector(0.0, 0.0, 2000.0);
Label = "Default";
Color = 1;
IsMagnetic = false;
ExtensionForMagneticArea = 0.0;
ExtensionLeft  = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;